GopalSaraf/Practicals/PSDL/include/proc/pic18lf8585.inc
// Register: CANCON_RO6
#define CANCON_RO6 CANCON_RO6
CANCON_RO6                               equ 0E5Fh
// bitfield definitions
CANCON_RO6_FP0_POSN                      equ 0000h
CANCON_RO6_FP0_POSITION                  equ 0000h
CANCON_RO6_FP0_SIZE                      equ 0001h
CANCON_RO6_FP0_LENGTH                    equ 0001h
CANCON_RO6_FP0_MASK                      equ 0001h
CANCON_RO6_WIN0_FP1_POSN                 equ 0001h
CANCON_RO6_WIN0_FP1_POSITION             equ 0001h
CANCON_RO6_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO6_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO6_WIN0_FP1_MASK                 equ 0002h
CANCON_RO6_WIN1_FP2_POSN                 equ 0002h
CANCON_RO6_WIN1_FP2_POSITION             equ 0002h
CANCON_RO6_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO6_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO6_WIN1_FP2_MASK                 equ 0004h
CANCON_RO6_WIN2_FP3_POSN                 equ 0003h
CANCON_RO6_WIN2_FP3_POSITION             equ 0003h
CANCON_RO6_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO6_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO6_WIN2_FP3_MASK                 equ 0008h
CANCON_RO6_ABAT_POSN                     equ 0004h
CANCON_RO6_ABAT_POSITION                 equ 0004h
CANCON_RO6_ABAT_SIZE                     equ 0001h
CANCON_RO6_ABAT_LENGTH                   equ 0001h
CANCON_RO6_ABAT_MASK                     equ 0010h
CANCON_RO6_REQOP0_POSN                   equ 0005h
CANCON_RO6_REQOP0_POSITION               equ 0005h
CANCON_RO6_REQOP0_SIZE                   equ 0001h
CANCON_RO6_REQOP0_LENGTH                 equ 0001h
CANCON_RO6_REQOP0_MASK                   equ 0020h
CANCON_RO6_REQOP1_POSN                   equ 0006h
CANCON_RO6_REQOP1_POSITION               equ 0006h
CANCON_RO6_REQOP1_SIZE                   equ 0001h
CANCON_RO6_REQOP1_LENGTH                 equ 0001h
CANCON_RO6_REQOP1_MASK                   equ 0040h
CANCON_RO6_REQOP2_POSN                   equ 0007h
CANCON_RO6_REQOP2_POSITION               equ 0007h
CANCON_RO6_REQOP2_SIZE                   equ 0001h
CANCON_RO6_REQOP2_LENGTH                 equ 0001h
CANCON_RO6_REQOP2_MASK                   equ 0080h

// Register: B4CON
#define B4CON B4CON
B4CON                                    equ 0E60h
// bitfield definitions
B4CON_FILHIT0_TXPRI0_POSN                equ 0000h
B4CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B4CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B4CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B4CON_FILHIT0_TXPRI0_MASK                equ 0001h
B4CON_FILHIT1_TXPRI1_POSN                equ 0001h
B4CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B4CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B4CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B4CON_FILHIT1_TXPRI1_MASK                equ 0002h
B4CON_FILHIT2_RTREN_POSN                 equ 0002h
B4CON_FILHIT2_RTREN_POSITION             equ 0002h
B4CON_FILHIT2_RTREN_SIZE                 equ 0001h
B4CON_FILHIT2_RTREN_LENGTH               equ 0001h
B4CON_FILHIT2_RTREN_MASK                 equ 0004h
B4CON_FILHIT3_TXREQ_POSN                 equ 0003h
B4CON_FILHIT3_TXREQ_POSITION             equ 0003h
B4CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B4CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B4CON_FILHIT3_TXREQ_MASK                 equ 0008h
B4CON_FILHIT4_TXERR_POSN                 equ 0004h
B4CON_FILHIT4_TXERR_POSITION             equ 0004h
B4CON_FILHIT4_TXERR_SIZE                 equ 0001h
B4CON_FILHIT4_TXERR_LENGTH               equ 0001h
B4CON_FILHIT4_TXERR_MASK                 equ 0010h
B4CON_RTRRO_TXLARB_POSN                  equ 0005h
B4CON_RTRRO_TXLARB_POSITION              equ 0005h
B4CON_RTRRO_TXLARB_SIZE                  equ 0001h
B4CON_RTRRO_TXLARB_LENGTH                equ 0001h
B4CON_RTRRO_TXLARB_MASK                  equ 0020h
B4CON_RXM1_TXABT_POSN                    equ 0006h
B4CON_RXM1_TXABT_POSITION                equ 0006h
B4CON_RXM1_TXABT_SIZE                    equ 0001h
B4CON_RXM1_TXABT_LENGTH                  equ 0001h
B4CON_RXM1_TXABT_MASK                    equ 0040h
B4CON_RXFUL_TXBIF_POSN                   equ 0007h
B4CON_RXFUL_TXBIF_POSITION               equ 0007h
B4CON_RXFUL_TXBIF_SIZE                   equ 0001h
B4CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B4CON_RXFUL_TXBIF_MASK                   equ 0080h
B4CON_FILHIT0_POSN                       equ 0000h
B4CON_FILHIT0_POSITION                   equ 0000h
B4CON_FILHIT0_SIZE                       equ 0001h
B4CON_FILHIT0_LENGTH                     equ 0001h
B4CON_FILHIT0_MASK                       equ 0001h
B4CON_FILHIT1_POSN                       equ 0001h
B4CON_FILHIT1_POSITION                   equ 0001h
B4CON_FILHIT1_SIZE                       equ 0001h
B4CON_FILHIT1_LENGTH                     equ 0001h
B4CON_FILHIT1_MASK                       equ 0002h
B4CON_FILHIT2_POSN                       equ 0002h
B4CON_FILHIT2_POSITION                   equ 0002h
B4CON_FILHIT2_SIZE                       equ 0001h
B4CON_FILHIT2_LENGTH                     equ 0001h
B4CON_FILHIT2_MASK                       equ 0004h
B4CON_FILHIT3_POSN                       equ 0003h
B4CON_FILHIT3_POSITION                   equ 0003h
B4CON_FILHIT3_SIZE                       equ 0001h
B4CON_FILHIT3_LENGTH                     equ 0001h
B4CON_FILHIT3_MASK                       equ 0008h
B4CON_FILHIT4_POSN                       equ 0004h
B4CON_FILHIT4_POSITION                   equ 0004h
B4CON_FILHIT4_SIZE                       equ 0001h
B4CON_FILHIT4_LENGTH                     equ 0001h
B4CON_FILHIT4_MASK                       equ 0010h
B4CON_RTRRO_POSN                         equ 0005h
B4CON_RTRRO_POSITION                     equ 0005h
B4CON_RTRRO_SIZE                         equ 0001h
B4CON_RTRRO_LENGTH                       equ 0001h
B4CON_RTRRO_MASK                         equ 0020h
B4CON_RXM1_POSN                          equ 0006h
B4CON_RXM1_POSITION                      equ 0006h
B4CON_RXM1_SIZE                          equ 0001h
B4CON_RXM1_LENGTH                        equ 0001h
B4CON_RXM1_MASK                          equ 0040h
B4CON_RXFUL_POSN                         equ 0007h
B4CON_RXFUL_POSITION                     equ 0007h
B4CON_RXFUL_SIZE                         equ 0001h
B4CON_RXFUL_LENGTH                       equ 0001h
B4CON_RXFUL_MASK                         equ 0080h
B4CON_TXPRI0_POSN                        equ 0000h
B4CON_TXPRI0_POSITION                    equ 0000h
B4CON_TXPRI0_SIZE                        equ 0001h
B4CON_TXPRI0_LENGTH                      equ 0001h
B4CON_TXPRI0_MASK                        equ 0001h
B4CON_TXPRI1_POSN                        equ 0001h
B4CON_TXPRI1_POSITION                    equ 0001h
B4CON_TXPRI1_SIZE                        equ 0001h
B4CON_TXPRI1_LENGTH                      equ 0001h
B4CON_TXPRI1_MASK                        equ 0002h
B4CON_RTREN_POSN                         equ 0002h
B4CON_RTREN_POSITION                     equ 0002h
B4CON_RTREN_SIZE                         equ 0001h
B4CON_RTREN_LENGTH                       equ 0001h
B4CON_RTREN_MASK                         equ 0004h
B4CON_TXREQ_POSN                         equ 0003h
B4CON_TXREQ_POSITION                     equ 0003h
B4CON_TXREQ_SIZE                         equ 0001h
B4CON_TXREQ_LENGTH                       equ 0001h
B4CON_TXREQ_MASK                         equ 0008h
B4CON_TXERR_POSN                         equ 0004h
B4CON_TXERR_POSITION                     equ 0004h
B4CON_TXERR_SIZE                         equ 0001h
B4CON_TXERR_LENGTH                       equ 0001h
B4CON_TXERR_MASK                         equ 0010h
B4CON_TXLARB_POSN                        equ 0005h
B4CON_TXLARB_POSITION                    equ 0005h
B4CON_TXLARB_SIZE                        equ 0001h
B4CON_TXLARB_LENGTH                      equ 0001h
B4CON_TXLARB_MASK                        equ 0020h
B4CON_TXABT_POSN                         equ 0006h
B4CON_TXABT_POSITION                     equ 0006h
B4CON_TXABT_SIZE                         equ 0001h
B4CON_TXABT_LENGTH                       equ 0001h
B4CON_TXABT_MASK                         equ 0040h
B4CON_TXBIF_POSN                         equ 0007h
B4CON_TXBIF_POSITION                     equ 0007h
B4CON_TXBIF_SIZE                         equ 0001h
B4CON_TXBIF_LENGTH                       equ 0001h
B4CON_TXBIF_MASK                         equ 0080h
B4CON_B4FILHIT0_POSN                     equ 0000h
B4CON_B4FILHIT0_POSITION                 equ 0000h
B4CON_B4FILHIT0_SIZE                     equ 0001h
B4CON_B4FILHIT0_LENGTH                   equ 0001h
B4CON_B4FILHIT0_MASK                     equ 0001h
B4CON_B4FILHIT1_POSN                     equ 0001h
B4CON_B4FILHIT1_POSITION                 equ 0001h
B4CON_B4FILHIT1_SIZE                     equ 0001h
B4CON_B4FILHIT1_LENGTH                   equ 0001h
B4CON_B4FILHIT1_MASK                     equ 0002h
B4CON_B4FILHIT2_POSN                     equ 0002h
B4CON_B4FILHIT2_POSITION                 equ 0002h
B4CON_B4FILHIT2_SIZE                     equ 0001h
B4CON_B4FILHIT2_LENGTH                   equ 0001h
B4CON_B4FILHIT2_MASK                     equ 0004h
B4CON_B4FILHIT3_POSN                     equ 0003h
B4CON_B4FILHIT3_POSITION                 equ 0003h
B4CON_B4FILHIT3_SIZE                     equ 0001h
B4CON_B4FILHIT3_LENGTH                   equ 0001h
B4CON_B4FILHIT3_MASK                     equ 0008h
B4CON_B4FILHIT4_POSN                     equ 0004h
B4CON_B4FILHIT4_POSITION                 equ 0004h
B4CON_B4FILHIT4_SIZE                     equ 0001h
B4CON_B4FILHIT4_LENGTH                   equ 0001h
B4CON_B4FILHIT4_MASK                     equ 0010h
B4CON_B4RTRRO_POSN                       equ 0005h
B4CON_B4RTRRO_POSITION                   equ 0005h
B4CON_B4RTRRO_SIZE                       equ 0001h
B4CON_B4RTRRO_LENGTH                     equ 0001h
B4CON_B4RTRRO_MASK                       equ 0020h
B4CON_B4RXM1_POSN                        equ 0006h
B4CON_B4RXM1_POSITION                    equ 0006h
B4CON_B4RXM1_SIZE                        equ 0001h
B4CON_B4RXM1_LENGTH                      equ 0001h
B4CON_B4RXM1_MASK                        equ 0040h
B4CON_B4RXFUL_POSN                       equ 0007h
B4CON_B4RXFUL_POSITION                   equ 0007h
B4CON_B4RXFUL_SIZE                       equ 0001h
B4CON_B4RXFUL_LENGTH                     equ 0001h
B4CON_B4RXFUL_MASK                       equ 0080h
B4CON_B4TXPRI0_POSN                      equ 0000h
B4CON_B4TXPRI0_POSITION                  equ 0000h
B4CON_B4TXPRI0_SIZE                      equ 0001h
B4CON_B4TXPRI0_LENGTH                    equ 0001h
B4CON_B4TXPRI0_MASK                      equ 0001h
B4CON_B4TXPRI1_POSN                      equ 0001h
B4CON_B4TXPRI1_POSITION                  equ 0001h
B4CON_B4TXPRI1_SIZE                      equ 0001h
B4CON_B4TXPRI1_LENGTH                    equ 0001h
B4CON_B4TXPRI1_MASK                      equ 0002h
B4CON_B4RTREN_POSN                       equ 0002h
B4CON_B4RTREN_POSITION                   equ 0002h
B4CON_B4RTREN_SIZE                       equ 0001h
B4CON_B4RTREN_LENGTH                     equ 0001h
B4CON_B4RTREN_MASK                       equ 0004h
B4CON_B4TXREQ_POSN                       equ 0003h
B4CON_B4TXREQ_POSITION                   equ 0003h
B4CON_B4TXREQ_SIZE                       equ 0001h
B4CON_B4TXREQ_LENGTH                     equ 0001h
B4CON_B4TXREQ_MASK                       equ 0008h
B4CON_B4TXERR_POSN                       equ 0004h
B4CON_B4TXERR_POSITION                   equ 0004h
B4CON_B4TXERR_SIZE                       equ 0001h
B4CON_B4TXERR_LENGTH                     equ 0001h
B4CON_B4TXERR_MASK                       equ 0010h
B4CON_B4TXLARB_POSN                      equ 0005h
B4CON_B4TXLARB_POSITION                  equ 0005h
B4CON_B4TXLARB_SIZE                      equ 0001h
B4CON_B4TXLARB_LENGTH                    equ 0001h
B4CON_B4TXLARB_MASK                      equ 0020h
B4CON_B4TXABT_POSN                       equ 0006h
B4CON_B4TXABT_POSITION                   equ 0006h
B4CON_B4TXABT_SIZE                       equ 0001h
B4CON_B4TXABT_LENGTH                     equ 0001h
B4CON_B4TXABT_MASK                       equ 0040h
B4CON_B4TXB3IF_POSN                      equ 0007h
B4CON_B4TXB3IF_POSITION                  equ 0007h
B4CON_B4TXB3IF_SIZE                      equ 0001h
B4CON_B4TXB3IF_LENGTH                    equ 0001h
B4CON_B4TXB3IF_MASK                      equ 0080h

// Register: B4SIDH
#define B4SIDH B4SIDH
B4SIDH                                   equ 0E61h
// bitfield definitions
B4SIDH_SID3_POSN                         equ 0000h
B4SIDH_SID3_POSITION                     equ 0000h
B4SIDH_SID3_SIZE                         equ 0001h
B4SIDH_SID3_LENGTH                       equ 0001h
B4SIDH_SID3_MASK                         equ 0001h
B4SIDH_SID4_POSN                         equ 0001h
B4SIDH_SID4_POSITION                     equ 0001h
B4SIDH_SID4_SIZE                         equ 0001h
B4SIDH_SID4_LENGTH                       equ 0001h
B4SIDH_SID4_MASK                         equ 0002h
B4SIDH_SID5_POSN                         equ 0002h
B4SIDH_SID5_POSITION                     equ 0002h
B4SIDH_SID5_SIZE                         equ 0001h
B4SIDH_SID5_LENGTH                       equ 0001h
B4SIDH_SID5_MASK                         equ 0004h
B4SIDH_SID6_POSN                         equ 0003h
B4SIDH_SID6_POSITION                     equ 0003h
B4SIDH_SID6_SIZE                         equ 0001h
B4SIDH_SID6_LENGTH                       equ 0001h
B4SIDH_SID6_MASK                         equ 0008h
B4SIDH_SID7_POSN                         equ 0004h
B4SIDH_SID7_POSITION                     equ 0004h
B4SIDH_SID7_SIZE                         equ 0001h
B4SIDH_SID7_LENGTH                       equ 0001h
B4SIDH_SID7_MASK                         equ 0010h
B4SIDH_SID8_POSN                         equ 0005h
B4SIDH_SID8_POSITION                     equ 0005h
B4SIDH_SID8_SIZE                         equ 0001h
B4SIDH_SID8_LENGTH                       equ 0001h
B4SIDH_SID8_MASK                         equ 0020h
B4SIDH_SID9_POSN                         equ 0006h
B4SIDH_SID9_POSITION                     equ 0006h
B4SIDH_SID9_SIZE                         equ 0001h
B4SIDH_SID9_LENGTH                       equ 0001h
B4SIDH_SID9_MASK                         equ 0040h
B4SIDH_SID10_POSN                        equ 0007h
B4SIDH_SID10_POSITION                    equ 0007h
B4SIDH_SID10_SIZE                        equ 0001h
B4SIDH_SID10_LENGTH                      equ 0001h
B4SIDH_SID10_MASK                        equ 0080h
B4SIDH_B4SID3_POSN                       equ 0000h
B4SIDH_B4SID3_POSITION                   equ 0000h
B4SIDH_B4SID3_SIZE                       equ 0001h
B4SIDH_B4SID3_LENGTH                     equ 0001h
B4SIDH_B4SID3_MASK                       equ 0001h
B4SIDH_B4SID4_POSN                       equ 0001h
B4SIDH_B4SID4_POSITION                   equ 0001h
B4SIDH_B4SID4_SIZE                       equ 0001h
B4SIDH_B4SID4_LENGTH                     equ 0001h
B4SIDH_B4SID4_MASK                       equ 0002h
B4SIDH_B4SID5_POSN                       equ 0002h
B4SIDH_B4SID5_POSITION                   equ 0002h
B4SIDH_B4SID5_SIZE                       equ 0001h
B4SIDH_B4SID5_LENGTH                     equ 0001h
B4SIDH_B4SID5_MASK                       equ 0004h
B4SIDH_B4SID6_POSN                       equ 0003h
B4SIDH_B4SID6_POSITION                   equ 0003h
B4SIDH_B4SID6_SIZE                       equ 0001h
B4SIDH_B4SID6_LENGTH                     equ 0001h
B4SIDH_B4SID6_MASK                       equ 0008h
B4SIDH_B4SID7_POSN                       equ 0004h
B4SIDH_B4SID7_POSITION                   equ 0004h
B4SIDH_B4SID7_SIZE                       equ 0001h
B4SIDH_B4SID7_LENGTH                     equ 0001h
B4SIDH_B4SID7_MASK                       equ 0010h
B4SIDH_B4SID8_POSN                       equ 0005h
B4SIDH_B4SID8_POSITION                   equ 0005h
B4SIDH_B4SID8_SIZE                       equ 0001h
B4SIDH_B4SID8_LENGTH                     equ 0001h
B4SIDH_B4SID8_MASK                       equ 0020h
B4SIDH_B4SID9_POSN                       equ 0006h
B4SIDH_B4SID9_POSITION                   equ 0006h
B4SIDH_B4SID9_SIZE                       equ 0001h
B4SIDH_B4SID9_LENGTH                     equ 0001h
B4SIDH_B4SID9_MASK                       equ 0040h
B4SIDH_B4SID10_POSN                      equ 0007h
B4SIDH_B4SID10_POSITION                  equ 0007h
B4SIDH_B4SID10_SIZE                      equ 0001h
B4SIDH_B4SID10_LENGTH                    equ 0001h
B4SIDH_B4SID10_MASK                      equ 0080h

